print("จงเขียนโปรแกรมเบื่อคำนวณหาปั้นที่ลามเหลี่ยมข้อมูลนำเข้าบรรทัดแรก รับด่าฐาน เป็นเลขจำนวนจริง = 0.25บรรทัดที่สอง รับค่าความสูง เป็นเลขจำนวนจริง = 5ข้อมูลส่งออกบรรทัดเดียวแลลงปั้นที่สามเหลี่ยม เป็นเลขจำนวนจริง0.625000")
print()
base = float(input("รับค่าฐาน: "))
height = float(input("รับค่าความสูง: "))
triangle_area = 0.5 * base * height
print("เเสดงพื้นที่สามเหลี่ยม")
print(f"{triangle_area:.6f}")
print()
print("สูตรในการเปลี่ยนค่าจากองศาเซลเซียสเป็นองศาปาเวนไฮล์และเคลวิน มีดังนี้ F=9/5C+32 K=C+273.15 ให้อ่านข้อมูลอุณหภูมิ (หน่วยจงสาเซลเซียส) แล้วผ่านวงเหล่าจะสาฟาเรนไฮต์และเควิน เมื่อ C คือ องสาเซลเซียส F จะสาฟาเรนไฮด์ และ0 K คือเคลวินข้อมูลเข้า หนึ่งบรรทัด \nประกอบด้วยตัวเลขจำนวนจริง 2 จำนวน คั่นด้วยเว้นวรรค จำนวนแรกคือค่าอุณหภูมิหน่วยองสาฟาเลนไฺฮจำนวนที่สองมีค่าอุนหภูมิหน่วยเคลวิน")
print()
C = float(input("กรอกค่าอุณหภูมิ (องศาเซลเซียส): "))
F = (9/5) * C + 32
K = C + 273.15
print(f"อุณหภูมิในหน่วยฟาเรนไฮต์: {F:.2f} °F")
print(f"อุณหภูมิในหน่วยเคลวิน: {K:.2f} K")
print()
print("a = {10, 20, 30, 40, 50,60}\nb = {30, 40, 50, 60, 70,80}\nนักเรียนเขียนคำสั่งด้วยภาษาไบทอนหาเซตของที่กำหนดให้แสดงผลตามที่กำหนด {70, 40, 10, 80, 50, 20, 60, 30} {40, 50, 60, 30} {10, 20} {80, 20, 70, 10}")

a = {10, 20, 30, 40, 50, 60}
b = {30, 40, 50, 60, 70, 80}
result1 = a.union(b)  # รวมทุกค่าในเซต a และ b
result2 = a.intersection(b)  # ค่าที่อยู่ในทั้ง a และ b
result3 = a.difference(b)  # ค่าที่อยู่ใน a แต่ไม่อยู่ใน b
result4 = a.symmetric_difference(b)  # ค่าที่อยู่ใน a หรือ b แต่ไม่อยู่ในทั้งคู่
print()
import time
time.sleep(.5)
print(result1)
print(result2)  
print(result3)  
print(result4)  
